{
    "a109f688-5c8c-4104-945c-a4ee871d8b28": {
        "status": "COMPLETED",
        "progress": 100,
        "status_message": "🎉 Processing complete!",
        "summary": "**Call Summary**\n\n**Date:** October 26, 2023\n**Participants:** David, Aman, Nemanda\n\n**Meeting Objective:** To review the current performance and operational aspects of the automated trading system, discuss specific trade execution, and identify areas for optimization.\n\n**Key Discussion Points:**\n\n*   **Automated System Performance:** Initial assessment indicates limited trading activity and a slight negative trend over the past few days. A comprehensive review is planned for the end of the week. David expressed a preference for minimal manual interference with the system until the scheduled review.\n*   **System Automation and Manual Profit Taking:** Nemanda confirmed the system is fully automated from start to end. However, \"take profit\" actions are occasionally managed manually. This manual approach is currently preferred over fixed profit targets due to observations that the \"maximum favorable excursion\" often significantly exceeds the actual realized profit, suggesting the need for profit-taking optimization.\n*   **Trade Logic Validation (Banana S31 Example):** Discussion revolved around a specific instance involving a \"Banana S31 pump\" where funding turned negative. It was confirmed that the system successfully executed a trade, triggered by its logic when funding closed below the 2% threshold, validating its ability to identify and act upon specified market conditions.\n*   **Market Indicators:** A \"green indicator\" was noted on the BTC 5-minute chart, a general observation regarding market conditions.\n\n**Decisions/Outcomes:**\n\n*   The current manual approach to profit-taking is considered beneficial but requires optimization to better capture potential gains from favorable excursions.\n*   The system's pre-defined trading logic was validated through a recent successful trade execution.\n\n**Action Items:**\n\n*   Nemanda/Team: Optimize the \"take profit\" strategy to enhance realized profits by better leveraging maximum favorable excursions.\n*   Nemanda/Team: Continue monitoring system logs and performance to ensure adherence to specified trading rules.\n\n**Next Steps:**\n\n*   A proper, comprehensive review of the automated trading system's performance will be conducted by the end of the current week.",
        "transcript": "on the fundings uh or funding stuff. hasn't really traded much. Um, I think it's down a little bit over the last two or three days, but Okay. I haven't checked in on it much. We'll we'll do a we'll do a proper review at the end of the week. Uh, for now, we'll sort of I see. Yeah, I'm try I I don't really want to touch it, to be honest. Okay. If I look at it too much, I'll just end up interfering with it. Yeah, yeah. Yeah. So is it is it running on AWS and like do you have an end-to-end like you're completely hands off on it? Uh, Nemanda, could you answer that, please? Uh, yeah, it's actually completely automated from uh start to end. Uh, just one thing that I think we are manually managing sometimes, the take profits. Uh, because Um, I think uh, it was better in terms of taking manual take profits instead of fixed. I see. Yeah, probably true, actually. Yeah. Yeah, one of the things that tends to happen with this is that you get a I think I mentioned it before, the the maximum favorable excursion. Yeah. It's a lot bigger on on average, it's much higher than than the actual profit. So, um, yeah, we'll have to optimize it. Um, I think some manual profit taking makes sense. Yeah. Are you able to see the uh what is it, the banana S31 pump yesterday? Like because the funding went negative and so I tagged you on the main chat, but not sure if you guys or the algo acted on it and took the trade. Uh, it was after hours for me, which is why I didn't reply. Um, Oh. No. Oh God. We checked the logs, see if it traded. I mean if if the funding closed below 2% then we would have traded. Yeah. It did actually. I saw it yesterday. Oh, okay, good, good. Yeah, at least so it's picking up, uh, it's picking up assets when your logic hits, um, whatever that is, like the rules that you have specified. Yeah. That's right. By the way, uh, David, if I may call you that. Uh, Please, yeah. Okay. Uh, there is a green indicator on, uh, BTC five minute. Okay, nice. I'm actually short. Um, I'm I'm short ETH right now. Um, so that's interesting. Yeah, so the green indicator is where you",
        "error": null,
        "id": "a109f688-5c8c-4104-945c-a4ee871d8b28"
    },
    "25198490-ae84-4407-8495-85941b5835c0": {
        "id": "25198490-ae84-4407-8495-85941b5835c0",
        "status": "COMPLETED",
        "progress": 100,
        "status_message": "🎉 Processing complete!",
        "summary": "**Call Summary**\n\n**Date:** October 26, 2023\n**Participants:** David, Aman\n\n**Key Discussions:**\n\n*   **Algorithmic System Automation:** The trading system is confirmed to be fully automated from end-to-end.\n*   **Profit Taking Strategy Optimization:** It was noted that \"take profit\" actions are occasionally managed manually. This approach is currently preferred over fixed take-profit mechanisms due to the observation that \"maximum favorable excursion\" often significantly exceeds actual realized profit. The need for further optimization in automated profit-taking strategies was acknowledged.\n*   **Algorithmic Performance on Specific Events:** The system's successful identification and potential execution of a trade on the Banana S31 asset were confirmed. This occurred when the funding rate dropped below the predefined 2% threshold, validating the algorithm's responsiveness to established trading logic.\n\n**Action Items:**\n\n*   **Strategic Review:** A comprehensive review of overall algorithmic trading performance is scheduled for the end of the current week.\n*   **Profit Taking Enhancement:** Evaluate and optimize the automated \"take profit\" strategy to better capture the full extent of favorable market movements.",
        "transcript": "on the fundings are or funding stuff. Doesn't really traded much. Um, I think it's down a little bit over the last two or three days, but Okay. I haven't checked in on it much. We'll we'll do a we'll do a proper review at the end of the week. Uh for now we'll sort of I see. Yeah, I I don't really want to touch it to be honest. Okay. If I look at it too much, I'll just end up interfering with it. Yeah, yeah. Yeah. So is it is it running on AWS and like do you have an end-to-end like you're completely hands off on it? Aman, could you answer that please? Uh, yeah, it's actually completely automated from uh start to end. Uh, just one thing that I think we are manually managing sometimes, uh, take profits, uh, because Um, I think it was better in terms of taking manual take profits instead of fixed. I see. Yeah, probably true actually. Yeah. Yeah, one of the things that tends to happen with this is that you get a, I think I mentioned it before, the the maximum favorable excursion Yeah. It's a lot bigger on on average, it's much higher than than the actual profit. So, um, I yeah, we'll have to optimize it. Um, I think some manual profit taking makes sense. Yeah. Were you able to see the um, what is it? The Banana S31 pump yesterday? Like because the funding went negative and so I tagged you on the main chat, but not sure if you guys or the algo acted on it and took the trade. Uh it was after hours for me, which is why I didn't reply. Um Oh, no, I got to We check the log see if it traded. I mean if if the funding closed below 2% then we would have traded. Yeah, it did actually. I saw it yesterday. Oh, okay. Good, good. Yeah, at least so it's picking up uh, it's picking up assets when your logic hits. Uh, whatever that is like the rules that you have specified, yeah. That's right. Yeah. By the way, uh, David, if I may call you that. Please, yeah. I'm sorry, it's just Okay. Uh, there's a green Dorito on uh BTC five minute. Okay, nice. I'm actually short. Um, I'm short ETH right now. Um, so that's interesting. Yeah, so the green Dorito is where you",
        "error": null,
        "filename": "3min.mp4",
        "created_at": "2025-08-06T15:40:12.303020",
        "completed_at": "2025-08-06T15:40:44.841035"
    },
    "7ceafa8e-9fca-43c0-9aae-bc7212eb9deb": {
        "id": "7ceafa8e-9fca-43c0-9aae-bc7212eb9deb",
        "status": "COMPLETED",
        "progress": 100,
        "status_message": "🎉 Processing complete!",
        "summary": "**Call Summary**\n\n**Date:** October 26, 2023\n**Participants:** David, Aman\n\n**Meeting Objective:** To review the current performance and operational status of the automated trading system, focusing on its funding strategy and profit-taking mechanisms.\n\n**Key Discussion Points:**\n\n*   **Automated System Performance:** Initial observations noted minimal recent trading activity on funding-based strategies, with a slight downturn over the past two to three days. The system is confirmed to be fully automated from start to end, operating independently.\n*   **Profit-Taking Strategy:** It was highlighted that manual management of take-profit actions is currently in place, as this approach has yielded more favorable outcomes compared to fixed take-profit settings. The discussion acknowledged that the Maximum Favorable Excursion (MFE) often significantly surpasses the actual realized profit, indicating an area for optimization in the automated profit-taking strategy.\n*   **Trade Execution Verification:** Confirmation was sought regarding the system's response to the \"Banana S 31 pump,\" where funding turned negative. It was confirmed that the system successfully executed a trade as the funding rate closed below the specified 2% threshold, validating its ability to identify and act on pre-defined market conditions.\n*   **Market Observations:** A \"green Dorito\" pattern was observed on the BTC 5-minute chart. Additionally, a current short position on ETH was noted.\n\n**Decisions Made:**\n\n*   The current approach of manual profit-taking will continue as an interim measure to optimize trade exits, pending further automated system enhancements.\n\n**Action Items:**\n\n*   **David:** Conduct a comprehensive review of the overall funding strategy performance by the end of the current week.\n\n**Next Steps:**\n\n*   Ongoing efforts to optimize the automated system's profit-taking mechanism to more effectively capture the Maximum Favorable Excursion.",
        "transcript": "on the fundings uh uh funding stuff. Hasn't really traded much. Um I think it's down a little bit over the last two, three days but Okay. I haven't checked in on it much. We'll we'll do a we'll do a proper review at the end of the week. Uh for now we sort of I see. Yeah, I'm I I don't really want to touch it to be honest. Okay. If I look at it too much, I'll just end up interfering with it. Yeah, yeah. Yeah. So is it is it running on AWS and like do you have an end to end like you're completely hands off on it. Um Aman, could you answer that please? Uh yeah, it's actually completely automated from uh start to end. Uh just one thing that I think we are manually managing sometime, the take profits. Uh because um I think uh it was better in terms of taking manual take profits instead of fixed. I see. Yeah, that's probably true actually. Yeah. Yeah, one of the things that tends to happen with this is that you get a I think I mentioned it before, the the maximum favorable excursion. Yeah. It's a lot bigger. On on average, it's much higher than than the actual profit. So um yeah, we'll have to optimize it. Um so I think some manual profit taking makes sense. Yeah. Were you able to see the um what is it? The Banana S 31 pump yesterday. Like because the funding went negative and so I tagged you on the main chat, but not sure if you guys or the algo acted on it and took the trade. Uh it was after hours for me, which is why I didn't reply. Um Oh. No, I got to We check the logs, see if it traded. I mean, if if the funding closed below 2%, then we would have traded. Yeah. It did actually. I saw it yesterday. Oh, okay, good, good. Yeah, at least so it's picking up uh it's picking up assets when your logic hits. Um whatever that is, like the rules that you have specified. Yeah. That's right. By the way, uh David, if I may call you that. Uh Please, yeah. I was sort of. Okay. Uh there's a green Dorito on uh BTC 5-minute. Okay, nice. I'm actually short. Um I'm I'm short ETH right now. Um so that's interesting. Yeah, so the green Dorito is where you",
        "error": null,
        "filename": "7ceafa8e-9fca-43c0-9aae-bc7212eb9deb_3min.mp4",
        "created_at": "2025-08-08T12:28:39.167058",
        "completed_at": "2025-08-08T12:29:08.739067"
    },
    "09dc205a-2baf-4623-a70b-97420dccd0b8": {
        "id": "09dc205a-2baf-4623-a70b-97420dccd0b8",
        "status": "COMPLETED",
        "progress": 100,
        "status_message": "🎉 Processing complete!",
        "summary": "**Meeting Minutes**\n\n**Participants:** David, Aman\n\n**Meeting Objective:**\nTo review the current status and operational aspects of the automated trading system.\n\n**Key Discussion Points:**\n*   **System Performance Overview:** The automated trading system has shown limited trading activity and a minor negative performance over the past few days. A comprehensive review is planned for the end of the week.\n*   **Automation Level:** The system is primarily automated end-to-end. However, \"take-profit\" actions are occasionally managed manually.\n*   **Take-Profit Strategy:** Manual intervention for \"take-profit\" has been implemented as it has proven more effective than fixed settings, particularly given that the \"maximum favorable excursion\" often significantly exceeds actual realized profits. This area has been identified for further optimization.\n*   **Trade Execution Confirmation:** A specific inquiry regarding a potential trade on Banana S31, triggered by negative funding, was addressed. Logs confirmed the algorithm successfully executed the trade in response to its pre-defined conditions (funding below 2%), validating its adherence to established trading logic.\n\n**Decisions Made:**\n*   A thorough performance review of the automated trading system will be conducted by the end of the current week.\n*   The current approach of manual take-profit will be maintained while optimization strategies for this function are explored.\n\n**Action Items:**\n*   **David & Aman:** Conduct a detailed performance review of the automated trading system by the end of the week.\n*   **David & Aman:** Investigate and implement strategies to optimize the take-profit mechanism to enhance realized gains.\n\n**Next Steps:**\n*   The findings from the end-of-week performance review will inform subsequent operational adjustments and strategic decisions.",
        "transcript": "on the fundings are our funding stuff.\nHasn't really traded much. Um I think it's down a little bit over the last two three days, but Okay. I haven't checked in on it much. We'll we'll do a we'll do a proper review at the end of the week. I see. Uh for now we'll sort of Yeah, I'm I don't really want to touch it, to be honest. Okay. If I look at it too much, I'll just end up interfering with it. Yeah, yeah. Yeah. So, is it, is it running on AWS and like do you have an end-to-end like you're completely hands-off on it? And the man, could you answer that please? Uh yeah, it's actually completely automated from uh start to end. Uh just one thing that I think we are manually managing sometimes the take profits. Uh because Um, I think it was better in terms of taking manual take profits instead of fixed. I see. Yeah, probably true actually. Yeah. Yeah, one of the things that tends to happen with this is that you get a, I think I mentioned it before, the the maximum favorable excursion. Yeah. It's a lot bigger on on average, it's much higher than than the actual profit. So, um, I yeah, we'll have to optimize it. Um, I think some manual profit taking makes sense. Yeah. Were you able to see the um, what is it, the banana S31 pump yesterday? Like because the funding went negative and so I tagged you on the main chat, but not sure if you guys or the algo acted on it and took the trade. Uh, it was after hours for me, which is why I didn't reply. Um, Oh. No, I'll go check. We checked the logs to see if it traded. I mean if if the funding closed below 2% then we would have traded. Yeah. It did actually. I saw it yesterday. Oh, okay, good, good. Yeah, at least so it's picking up, uh, it's picking up assets when your logic hits. Um, whatever that is, like the rules that you have specified. Yeah. By the way, uh, David, if I may call you that. Please, yeah. I'm sure it's news. Okay. Uh, there's a green burrito on uh, BTC five minute. Okay, nice. I'm actually short, um, I'm short ETH right now. Um, so that's interesting. Yeah, so the green burrito is where you.",
        "error": null,
        "filename": "09dc205a-2baf-4623-a70b-97420dccd0b8_3min.mp4",
        "created_at": "2025-08-08T12:33:46.666100",
        "completed_at": "2025-08-08T12:34:21.669575"
    },
    "e9758bab-da8e-4dca-bec1-30c32bcb2cdc": {
        "id": "e9758bab-da8e-4dca-bec1-30c32bcb2cdc",
        "status": "PENDING",
        "progress": 0,
        "status_message": "Initializing...",
        "summary": null,
        "transcript": null,
        "error": null,
        "filename": "e9758bab-da8e-4dca-bec1-30c32bcb2cdc_2025-07-29_20-29-18.mp4",
        "created_at": "2025-08-08T12:34:39.951030",
        "completed_at": null
    },
    "c5f3be16-649f-4343-b74c-774ee5a5e42e": {
        "id": "c5f3be16-649f-4343-b74c-774ee5a5e42e",
        "status": "COMPLETED",
        "progress": 100,
        "status_message": "🎉 Processing complete!",
        "summary": "**Meeting Minutes**\n\n**Date:** October 26, 2023\n**Participants:** David, Naman, Q\n\n**Meeting Objective:**\nTo review the performance of the current automated trading strategy, discuss new potential strategies, and outline a collaborative approach for systematic development and backtesting.\n\n**Key Discussion Points:**\n\n*   **Automated Funding Rate Strategy Review:**\n    *   The currently deployed automated strategy operates on AWS and is fully hands-off, except for manual take-profit management, which has shown to improve profitability compared to fixed settings.\n    *   The system successfully traded based on its internal logic during a recent market event (Banana S31 pump).\n    *   Current performance indicates suboptimal results when running unattended, suggesting a need for more adaptive exit strategies, such as automated trailing stop-losses.\n    *   A past challenge regarding unannounced changes to funding rate intervals by exchanges has been addressed by Naman.\n\n*   **Doritos Indicator Strategy Exploration:**\n    *   David presented observations on the \"Doritos\" indicator for potential trading signals. Q disclosed its open-source nature, confirming it is based solely on price action (OHLC) and originates from a Forex indicator adapted for TradingView.\n    *   Q is actively developing a Python script to replicate and systematically backtest this indicator.\n    *   The discussion highlighted the importance of optimizing indicator input variables through permutations to identify the most robust settings.\n    *   Emphasis was placed on the necessity of comprehensive backtesting metrics, including Sharpe/Sortino ratios, maximum drawdown, and capital flows, for accurate profitability assessment.\n\n*   **Volume Breakout Strategy (Altcoins):**\n    *   Q detailed a manual strategy identifying altcoins with significant volume percentage changes using a proprietary screener. This screener leverages a custom 30-second candle generation from tick data (including USD buy/sell volume) to rank assets in real-time.\n    *   Observation suggests that substantial volume spikes often precede significant price movements, indicating a potential leading indicator.\n    *   This strategy is currently traded manually with tight stop-losses and dynamic trailing stops to capture the majority of price moves, acknowledging the inherent tail risks of highly volatile assets.\n    *   Full automation would necessitate backtesting across the entire market universe to neutralize hindsight bias.\n\n*   **VWAP/SMA Fading Strategy:**\n    *   A brief review of a basic mean reversion strategy (fading moving average and VWAP clusters) showed initial promise in rudimentary backtests. However, a lack of detailed performance metrics necessitates further rigorous analysis.\n    *   Potential confluences, such as volume spikes or Cumulative Volume Delta (CVD), were suggested to enhance this strategy's conviction.\n\n*   **Backtesting Infrastructure and Collaboration:**\n    *   Q presented his robust Python backtesting framework, capable of rapid and comprehensive analysis, including advanced statistical outputs and equity curve visualization.\n    *   A collaborative effort to develop a real-time market dashboard, integrated with Q's database for continuous market overview, was proposed.\n    *   The team agreed to prioritize a single strategy for focused development to ensure efficient progress.\n\n**Decisions:**\n\n*   **Strategy Prioritization:** The Doritos indicator strategy will be the immediate focus for systematic development and backtesting.\n*   **Backtesting Protocol:**\n    *   Q will proceed with converting the Doritos indicator into a Python script and performing comprehensive backtests using his framework.\n    *   David and Naman will simultaneously work on backtesting the Doritos indicator (or a foundational strategy for tool proficiency) on TradingView.\n    *   Results from both Python and TradingView backtests will be compared for validation.\n\n**Action Items:**\n\n*   **Naman:**\n    *   Provide Q with access credentials for the shared email to facilitate database access.\n    *   Share the existing funding rate strategy code/logic with Q to enable its replication and comparative analysis.\n    *   Commence learning and executing basic strategy backtests on TradingView.\n    *   Explore importing funding rate data into Q's database and developing an automated script for its continuous collection.\n*   **Q:**\n    *   Finalize the Python script for the Doritos indicator and conduct comprehensive backtests, including detailed performance metrics.\n    *   Push relevant code to a GitHub repository for shared access.\n*   **David:**\n    *   Collaborate with Naman on the TradingView backtesting tasks.\n\n**Next Steps:**\n\n*   Reconvening is scheduled within two to three days (prior to the end of the week) to review initial backtesting results and discuss ongoing progress.",
        "transcript": "on the fundings are our funding stuff. has it really traded much. Um, I think it's down a little bit over the last two or three days, but Okay. I haven't checked in on it much. We'll, we'll do a, we'll do a proper review at the end of the week. Uh, I see. Yeah, I I don't really want to touch it to be honest. If I look at it too much, I'll just end up interfering with it. Yeah, yeah. Yeah. So, is it, is it running on AWS and like, do you have an end to end, like, you're completely hands-off on it? Naman, could you answer that please? Oh, yeah, it's actually completely automated from, uh, start to end. Uh, just one thing that I think we are manually managing sometime, uh, take profits. Uh, because Um, I think it was better in terms of taking manual take profits instead of fixed. I see. Yeah. probably true actually. Yeah. Yeah, one of the things that tends to happen with this is that you get a, I think I mentioned it before, the, the maximum favorable excursion. Yeah. It's a lot bigger on, on average, it's much higher than, than the actual profit. So, um, Yeah, yeah. We'll have to optimize it. Um, I think some manual profit taking makes sense. Yeah. Were you able to see the, uh, what is it? The Banana S31 pump yesterday? Like, because the funding went negative and so, I tagged you on the main chat, but not sure if you guys or the algo acted on it and took the trade. Uh, it was after hours for me, which is why I didn't reply. Um, No, all good. We check the log to see if it traded. I mean, if, if the funding closed below 2%, then we would have traded. Yeah. It did actually. I saw it yesterday. Oh, okay, good, good. Yeah, at least, so it's picking up, uh, it's picking up assets when your logic hits. Uh, whatever that is, like the rules that you've specified. Yeah. By the way, uh, David, if I may call you that. Uh, please. Yeah. I prefer it. Yeah. Uh. Okay. Uh, there's a green burrito on uh, BTC five minute. Okay, nice. I'm actually short. Um, I'm, I'm short ETH right now. Um, so that's interesting. Yeah, so the green dorito is where you take profits, right? Like if you're short. Yeah. There is a green dorito on ETH as well. Sorry. Oh really? I need to have pulled that layout. No, maybe. Oh, I did not share the layout. Sorry, I'll send it right away. No, it's okay. I'll, uh, I've, uh, I've got something rigged up here. Yeah, I see what you mean. That's probably quite a strong signal. Yeah. uh, with two together like that. All right, at least take some profits if that makes sense. take some off here then and, uh, and I can stop back in lower down. Yeah. By the way, uh, I'm trying to see if I can recreate this doritos indicator, uh, and back test it. He's not shared. He's not shared the source code, but, uh, Yes. There's. It is open source actually. Oh. That's interesting. Yeah. I didn't even know what it's based on. I mean, I, I bought it. Um, and I couldn't see what it was. It looks like some sort of swing failure on, on the price action. Yes. I don't, I don't know if it incorporates volume or not. Uh, no it doesn't. It's just price action, OHLC, no volume. Interesting. Okay, interesting. That was my suspicion. And So, so, you know InSilico, right? The guy InSilico, not the InSilico Terminal. Plot. Uh, so that guy, that guy was in crypto a long time ago and then he started a Telegram channel, uh, where he posted random content, which was like pure alpha. And, and then, he also started coding indicators on TradingView. So, this is one of his indicators on TradingView. Oh, I see. Interesting. But, but it is not his original indicator. He stole this indicator from some forex guru, uh, who was trading foreign exchange, uh, like currencies. Um, and just converted it to a TradingView script. Okay. All this, all this was like seven, eight years ago, nine years ago. How'd you know about this, Q? Uh, somebody was speaking about some on the, somebody pointed it out in the group chat, in the voice chat, uh, one time. Oh, okay. And then I looked it up and lo behold. So, the Vespa indicator has a lot of other things, the levels, but the Doritos itself is a completely separate indicator with the same input, same language, same everything. That's pretty interesting. I don't I don't want to burst his bubble, but, uh, like I'm sure he's made some changes to the indicator, but I don't, I'm trying to convert it to my, I don't want to be the bad guy and say, hey, you stole this or whatever. Like, he's still sharing stuff with us, right? So I want to respect that. Yeah. And, and there's not many original things, right? When it comes to extracting indicators. Yes. Yeah. Yeah. And, you know, what Q is really interesting because the first time he spoke about it, well, it was the first time I heard about it. He said it, it was related to volume. Um, and I, I just, I had my doubts about that because I just couldn't see any correlation or any connection to volume whenever I looked at it on a chart. Yeah. Um, but I could see some price patterns. Yeah. So it's interesting, it's interesting that, uh, you don't see the volume connection either. Right? I'll just share, uh, the exact, like you see this page, please keep it to yourself, David. I don't want any issues within the, within the group if that makes sense. 100%. 100%. No, I, I won't, I won't share any of this. So, if you look at just the screenshot, I see. Yeah. That's very, very similar to what, and so, this is the TradingView indicator that is open source. Like, you can look at, it's, it's 60 lines of code. Okay. I'm gonna, wait, let me, I'm gonna put this on my TradingView now. Yeah. You can, you can hide the Vespa indicator and just put the same input like 4060 or 4010 or 60100 or whatever and it will draw the same lines and the same Doritos. Oh really? Interesting. Okay, that's very interesting. Yeah, okay. So, 40 100. Yeah, even the, um, the input have the same names as well. Yes. Okay. Yeah, I won't, I won't mention anything, Q, don't worry. Okay. Yeah, thanks for sharing that. No, again, I'm not, I'm not saying it is bad or whatever, but I'm just trying to convert this into Python to see if, uh, we can systematically find an edge there, like with a tight stop loss. Yeah. Yeah, makes sense. Because the input he's given us, which is 4060 or 60100, uh, they are different from the default inputs, which is like 4010 on the indicator. Yes. Um, and, and I want to see over time if those indicators, like, we're not trying to overfit, but we want to actually fit to and this source code was, is from 2019. Like, if you see the date, so that's like six years old. Yeah. And the way actually I found it also, I confirmed it was, uh, he, he liked, or if you go on his profile, he liked this indicator itself and that looks very similar to Vespa. And so, I was like, okay, if he's liked it, he's not commented on, on the TradingView screen or anything, he's just liked it. And so, um, and if you search for the name, there is actually a few like other platforms that use the same indicator for trading. Hmm. That's some very good sloothing. I mean, I'm not spoofing, I just wanted to see what the juice is and like trying to replicate it. Yeah. No, no, that's cool. I mean, I, I wondered about it myself. Um, I just had no idea how to actually go about figuring that out. Yeah. But you know, that's very interesting because, um, Naman and I did some stats, uh, a few weeks ago and we were looking at the, the moving averages and the VWAPs. Yeah. Um, and, uh, well, so I, I, I, I'll share another secret with you then. Uh, Q. Uh, I, I've shared a screenshot of, of the equity curve. Um, uh, D-Speed shared and, um, and I said to, I said to Naman, like, you know, there's, um, this is an automated strategy. It's based on VWAPs and SMAs. Uh, and, and we started trying to figure out ways to, um, replicate that or, or work out our own strategy. Mm-hmm. Um, we didn't, we didn't, we didn't do anything on it yet because, um, we, we focused our efforts getting the funding rate strategy running. Yeah. Um, but we did do some stats on it. Um, Naman did some stats that were quite cool. Um, so sorry if you, if you don't mind me asking. So, you just shared the equity curve that he posted with Naman? Well, the screenshot. Just, just basically, just, just to show. I mean, he didn't say anything about what the strategy was. Yes. He just said it was related to Vespa. So, I was saying to Naman, you know, can we do something based on moving averages and VWAPs? And I think that was not Vespa or moving averages. That was basically this indicator, because that gives you the entry and the exit signals. Okay. Interesting. So, we can, again, we can, it's not very difficult to do a back testing on TradingView and I can, once I finish coding this in Python and I have my data and I run it against my database to see if, uh, we are getting similar results on TradingView versus my results. And so, that way we can compare, uh, if where there are discrepancies, is there a bug in the code, in the indicator, or is there a bug in the signal, or what's wrong? Before we bring, before we even consider, like, hey, if it is profitable and the equity curve is good, before we bring it live. If that makes sense. So, uh, so you're saying we should, uh, back test some strategies? Q, is that, is that the idea? Yeah, so, back test on the same strategy, for example, on TradingView versus in Python. Say. Awesome. So, they should match. Ideally, they should match because the underlying data for price action is the same, right? Mm-hmm. Yeah. Um, so, the equity curve, the drawdown, everything should be very similar. Yeah. Yeah, they should be, they should be identical, right? Yeah. In theory. Okay. And then, and then on top of that, what TradingView doesn't have, what I have, is the buy sell delta. So, we can incorporate those things into the strategy. Like, trap traders, uh, things like that. Because this strategy is just purely based on price action. But then we can add more confluences to improve the entries and the exits. Yeah, I think some confluences would most likely be needed. I think just trading the, the Doritos on by themselves. Well, I haven't tested it, but I would imagine it's not effective by itself. And so, Have you tested that, Q? Just a, a Dorito only strategy? Um, no, I'm still just coding the indicator. I found this over the weekend when I was scrolling. I, I didn't, I, I haven't had a lot of time with the indicator myself. So, I have to first code it in Python, try to replicate the same Doritos first in Python before I even back test it, right? Yeah. Yeah. Um, the other thing is, um, that I want to test is, um, there are two variables in, um, in the input of the indicator. But there is one other variable that is hardcoded in the function itself. And if Naman wants to see, I can share the source code, but, uh, are you, uh, David, are you in front of the TradingView screen? I can share. Yes, I am. So, if you click on the source code, don't open the source code, it'll just open in a small window in on the screen. Uh, for the indicator. Yep. Yes. Okay. So, line nine and 10 is, uh, the inputs. But then, uh, if you see line 20 and 21, it is comparing close versus like the close of four, meaning the fourth candle before the current candle. Yeah, I see that. So, four is hardcoded. We can add that as a variable. Like, how far do you want the look back to be? Ah, okay. So, that way we can make, my, my, uh, back testing library that I use, uh, can identify, can loop through all these inputs. So, I can in the first input, instead of just doing 40, I can do 40, 50, 60, 70 up to 100. The second input, I can do 10, 20, 30 up to 100. The third input, I can do three, four, five, six, or whatever, I can pass in a list and then it will loop through all of those, uh, permutations and combinations and tell me for this asset, which is the best, it is overfitting. But for this asset, which is the best, uh, inputs that you can use. And we can use those inputs on, because right now we need to use TradingView for visualization. I don't have, I don't have, uh, like UI built in into my coding, my trading system. So, until then, we can use those inputs to visualize what is going on on the indicator itself. Okay. Am I, am I clear? Am I vague? Sorry. So, what I think, so I'm, I'm, I'm not an expert when it comes to the Templar stuff and group. So, what I'm, what I'm, what I'm hearing is, uh, you're suggesting that we adjust the indicator so that we can adjust this extra variable and then just experiment with it visually on TradingView. Uh, no, I will experiment in the back end with my back testing framework, which will give me, which will tell me, hey, these are the good inputs that you should use, uh, will perform the best based on the back test. And then we, we put those numbers in to see what is actually happening on TradingView. Okay. Yeah, I see. I see. And then we could do like a, a strategy on TradingView with those parameters. Yes. Okay, got it. That makes sense. Um. And then we can add more confluences like levels, predefined levels, like yearly VWAP, 200-day moving average or, or, uh, even the high time frame and low time frame indicators. Like, or high time frame like you were saying, D-Wall. I think that's what you said. Uh. You said something like, we need to get into a low time frame, uh, R-wall to see to, to perfect our entries and exits. Well, that that was just one, one suggestion. Yeah, so, maybe, um, Naman, could you do me a favor? Could you please, um, get the stats, uh, that we have for the, um, the, the SMA and, and the VWAP fading strategy. And put them on the chat here. Oh, sure thing sir. Just do. Uh, sure thing. I will just, uh, give me a minute, please. Yeah, no worries. Thank you. So, I mean, so I guess there's different strategies, right, Q? So, uh, and when it comes to the big, when it comes to the, the VWAPs and the SMAs, uh, and trade and trading when they're, when they're overlapping one, one another. I think that's fundamentally a fading strategy, right? Um, and we've got some basic stats on that. It, it's a just a starting point for now. Um, but, uh, you'll have a look at them in a moment and I think there's something there. And then if we wanted to add confluences to that, I suppose it'd have to be confluences that make sense, right? So, I, I was just brainstorming here, um, of some indicators that could add, add conviction. Um, we haven't tested it, but it stands to reason that, um, if, if, um, a cluster of, um, of SMAs and VWAPs, um, are going to be strong support or strong resistance and they're gonna hold. There should be some kind of spike in volume. At least, at least on the low time frame or or some noticeable increase. I think something like that might be worth testing. Okay. Um, especially because it's probably quite easy to test. Um, and you you could go infinitely more complex, like, um, we could start, you know, looking at like some CBD, um, some increases in, in volume delta. Um, my only concern with stuff like that is that if it starts getting too complex, um, then you're, you know, you start overfitting. Um, and, and once it gets too complex, it probably just doesn't work. So, the other strategy I was thinking after, so, one thing I say we do is, we prioritize which strategy do we want to go for first, which is either we do, uh, the Vespa, uh, Doritos or, uh, those are the two that I was most recently working on, which is why I'm saying that. Or the momentum breakout strategy, which is, uh, like alts flying 30, 40% and we capture the upside on those. So, which one should we prioritize? Uh, I don't want to go, uh, in all directions and like, not make any progress. So, I would rather stick with one. We we find the results and see if there's something there for us and we make progress that way. Yeah, I completely agree. I completely agree with that. Um. Oh, by the way, uh, sorry. One other thing. I don't have access, so Naman, if you can grant me that email address that I shared earlier. Yeah, just a second. So, Q, um, a note on these statistics, um, but, uh, same, same comment that you made actually before. Like, because this, um, this, this work sort of belongs to D-Speed. So, um, Yes. I did actually share this with him. Um, Okay. when we did it. Um, and I said, uh, I, and I only shared it with him, uh, and I just, just said, look, you know, this is, this is your thing. So, I'm not putting it on the group, right? Uh, same thing, same thing that you said. Um, um, and, and we left it at that. Um, I thought, I thought he might be interested in sort of working on something automated, but, um, I don't know, I tried to catch up with him a couple of times. Um, I don't think it's a priority for him right now. Yeah. I think, at least what I am assuming that he's just doing this because he's passionate, not because he needs the money for, uh, for his day-to-day life. Like, he's had, uh, he has enough resources that he could care less about optimizing a strategy, which, like, he doesn't need this for a living. Like, he doesn't want to spend more efforts than it is necessary. It seems that way to me. Yeah. Yeah, I agree. I agree. But, I think, um, well, it's something we can discuss later, Q. Yeah. Uh, what, what I, I mean, uh, I would probably, well, we can discuss it. I mean, I would probably want to sort of let him know what progress we're making, what we're doing, um, out of just, uh, courtesy, I suppose. Yeah. Yeah. So, so this is one setup. Right? Uh, Yes, one setup. So, if you, so the, the, the first page is just kind of like the explanation and then the statistics tab on the left if you can see that. Yeah. So, that's got the statistics on it. Um, so, what we were basically looking at here was, um, a very, very basic mean reversion strategy. So, fading the 200 MA, for example. Uh, I think, I think we've got a few different levels mentioned in this document. Uh, quarterly VWAP. And then I do believe there's going to be, um, an overlapping levels strategy as well. That had the best, and that had the, yeah, here we go. So, if you, towards the bottom, uh, clustered indicators. Can I, uh, share my screen if that is easier? I think you are on the wrong page, WQ. Uh, it needs to be on the statistics page. Yeah, I'm on the statistics page. I'm on, I'm looking at Eth and so. So, if you scroll all the way to the bottom, yeah. So, the, the final, uh, black, black box with the table of figures on it. Uh, top scenarios. Yes, I see it. Combined long short. So, this is kind of, this is the best, the, the best, uh, most basic back test that we did. Uh-huh. And this is quite rudimentary, but it's a, it's a cluster of three, um, of three overlapping, uh, levels. And it can be any levels, right? So, uh, any, any combination of, of three, um, SMAs and VWAPs. Okay. And then your, your fading, fading a touch of that cluster. Yeah. And then you see, uh, um, so, for the back test you got the 1% stop loss, 3% take profit, uh, win rate, profit factor and expectancy. Yeah. So, there's definitely something there. There's definitely something there. Um, Naman, do you remember, um, how far back this back test goes? Um, I don't think it was that. Two years or three years maybe? Yes, it was two years. Okay. Uh, so, so Q, it's, that, that's not, that's not a very large number of trades for two years, right? Yeah. But also, it is only, it's, it's also only one market. Yes, but, so, sorry, quick question. Do you know say, uh, like what are the numbers? What is the, the sharp or the sortino of this strategy or what is, what is the starting capital and the max drawdown and what is the ending, ending capital with and without fees? So, that way we know, yes, this stats, these stats are good, but without those numbers, it is hard for us to visualize what the equity curve for that strategy is going to be, because since this is all 100% automated. Indeed. I'm not sure if we have those. Uh, Naman, yeah, can you also please? Yes. I think we were in the early stage of testing this. So, we were just applying some Monte Carlo principles, uh, trying out random things and, uh, figuring out what could work best. Uh, we haven't went towards that and searched towards another project instead. I see. Okay. So, uh, David, it feels like, yes, there's something there, but, but we need, Hello. And, and I'll share one of my strategies, one of my very basic strategies and how I do, uh, my back testing and I, I will share the output of that back testing framework. Um, and I can actually share it in the chat right now. One sec. So, that gives us more comprehensive, uh, information. So, so, what happens is, when you back test, so, first step is coding an indicator. Once you code an indicator, you generate signals based on that indicator. Or regardless how you code an indicator, you generate signals based on whatever your rules are and whatever your criterias are. And, and when you pass that information to the back testing framework, it tells you, when it takes the trade, uh, when it gets stopped out or when it gets, uh, exited into take profit. And then, at the end of it, uh, when the entire time series passes through, it gives you the stats of how profitable the strategy is. So, you can do that with fees, without fees. And then it gives you, if you want, you can plot the price and the equity curve, uh, like how D-Speed shared, uh, in Python. And so, you can actually visualize, hey, this is the time it took a trade. It actually gives you the timestamp of when the criteria met and you actually entered the trade. So, you, it is as if you're looking at a strategy performing live, but on historical data. Yeah. Yeah. And you do this on TradingView? No, no, no. This is all in Python, in my, in my application. Oh nice. Okay. You have created a library also. Uh, yes. So, I do have, uh, a few different libraries that I use, uh, to get this information. So, this is what I worked on last two, three years. Uh, when I was doing all the data collection and all the stuff that I did for my, uh, my database. So, like, I already have some pre-calculated indicators in the database. So, like moving average. Yes, it is not taking time. But if you were to always calculate for 400 assets on like, say, four or five different time frames, that takes time. Um, yeah, and then it is also optimized to run faster. So, uh, yeah, we can, we can go in detail about that, but like, I'll just share, uh, the exact, uh, output of what the indicator or what the back testing library gives me. Okay. Yeah. Uh, but yeah, this sounds good. But without, without the, uh, the sharp ratio, the starting capital, the ending capital, or sorry, where you're ending, you don't know actually if the strategy is profitable or not. Okay. So, in that case, uh, Q, if you, if you agree that this is worth pursuing, then it sounds to me like we have a pathway, uh, to move forward. So, do you want to do, so then this is the third strategy on top of the Doritos, the, the momentum breakout on alts. And this is like adding, do you want to, add this as a confluence to the first two or do you want to, um, do you want to add this as a completely separate strategy? To me, it seems like a separate strategy. Um. In terms of the alts breakout, um, I don't actually know how you're trading that, Q. I mean, is that, is that deployed right now? Is it something you're doing? No, I, it's not automated. I'm getting alerts, um, and based on those alerts, I act on it. Okay. Is, and is it working for you? Yes. Okay. Okay. Well, that's good. Um, I think it would be different, um, to be honest. I think it's a separate strategy. Okay. Um, so, we could treat them, I mean, we could focus on the first, on the alts breakout, if, if that's already working. Um, or we could do, yeah, I, I'm, I'm, I'm quite open, Q, to be honest. Um, I'm quite open in terms of the order. All right. Um, so, I am personally working on, uh, the Doritos. I've shared the code with you if you want to work on it. That's fine. Or we can, um, converge, uh, like you guys can go ahead with a different strategy. You already have access to my database. So, um, if you want to code it in TradingView or Python, that's up to you. Uh, I'm going to definitely, or what we can do is, you convert this, uh, indicator into a trading view strategy and I do that on my side, on Python. And then maybe in a day or two, we come back and compare our results. So, okay. So, we turn Doritos into a, uh, Python script and then back test it. Is that what you mean? That is what I am doing. And you guys do the same thing on TradingView. Because TradingView back testing, there's an option on TradingView back test it. The D-Speed shared.\nif you feel comfortable at least uh have your code pushed up into a GitHub repository. So, like all of your previous work. If you don't mind uh sharing that with me, um then I can share all of my work that I have done and we can see uh That's that's that's not even a big task, like it should take half an hour maximum. But uh But like if Uh What If you want, I know TradingView does not is not the best uh has its own limitations with strategy testing, but it would be beneficial if you could figure a way out on that, so that way once I have a strategy tester on my end, we can compare the results between the two. Okay. That would be my that would be my take. Um not sure what your thoughts are on this. Yeah, I think it works. Um And then I think that part's going to be quite easy and then I think the main part is going to be how are we going to um how are we going to develop a process to to backtest and tweak the parameters. Oh, that I have I have that already. So, once I have the strategy, um I have to give it a a list of inputs and it will give me the list of outputs on which parameters give the best results. Oh, so is it is it able to test all the various different combinations of variables? Yes, yes. Yes. Okay. I remember I think this is something we've you've done this before as well. I forget what it's called. Um the computationally expensive one. I don't remember. Yeah. Okay. Okay. Yes, I have optimized it. It gives me an output in in minutes, not even hours. And uh And the code runs even if you run one combination or if you run 20 uh different combinations, the code doesn't take a long. It it doesn't take linearly uh long to run 20 combinations. So, like it's very fast. It's it runs on machine level code. Okay, nice. You have compiled it? Yeah. Yes, so there is a there's a package called Numba. Do you know Numba? Yes. Yeah, I'm using the same package. Yes. Yeah, so you you convert that into Numba and the Numba loops uh are extremely fast on uh um when it converts to machine level code. Um And then I have if I am not able to run it on my laptop, I run it on my desktop. If I'm not able to run it on my desktop, I run it on the main server. It has 256 cores and one terabyte of RAM. So, uh so yeah, like computer is not even a question. It runs. It's sitting in my David, it's it the database is sitting in my uh one of the bedrooms here at the house. And I have like two ISPs. I have two ISPs. So, I don't pay for cloud at all because that is if I were to store all this in the cloud, it is crazy expensive. Yeah. Yeah, yeah, yeah. I know. Okay. Um okay, good. That's that all sounds um that all sounds yeah, very reasonable. Um Okay. What that works for me. Okay, so Naman, to summarize, uh If you don't mind sharing the code on the um on the group chat here in Discord. Um I can take that code, backtest it myself in Python. And meanwhile, you can use the same code to see generate signals on TradingView and then we can compare the results on TradingView and I can compare uh I can come up with my results in a day or two. Yeah, sure, I think I will uh I will dig into my laptop and just find out because it's been a while since I we worked on this project. Okay. Yes. Okay. Do you you think it's worthwhile if if we try to do the backtest on uh TradingView? I mean, at least we will know we are investing time in understanding, hey, if it is worthwhile or not. So, at least doing it once is worthwhile, then we know if it is worth it or not. Okay. Okay, so we'll do that on our end then. You can just do a simple strategy. We don't have to do like a complicated one on TradingView. Like a simple a simple moving average crossover and see how how do you code that strategy in Pine Script on TradingView and you can look at the results. Yes. Is it going to be profitable? No. Is it a waste of time? Yes, but at least you know how to use the tool and um that way when you want to backtest a more complicated strategy, you're not figuring it out. Like you already know how to do backtesting on TradingView. Okay. I think the goal should be if we can to implement a version of of this strategy on there as well, right? Yeah, so that would be that would be our second attempt at it. Like the first attempt is to actually learn the tool itself. Okay. Okay. Uh cool. Um yeah, that makes sense. Hey Q, you mentioned earlier about um the the out breakout strategy. Like so how how does that work? Um I think I uh shared it with you. Um So, just looking at here, I'll uh the screenshot. Uh You showed me a lot about the volume rankings, uh and comparing them to previous days and things like that, but I I it wasn't clear to me like what what the signal is in that. Uh So, can you look are you able to see the screenshot from the screener? Yeah, I see it. Yeah, so if you see the rank is 91, Siren USDT. Yeah. The volume yesterday was uh $800,000. But the volume today is $43 million. Yes. The column column four and column seven. So, the volume percentage change between those two days is about 5,000%. So, it's not volatility percentage change, it's volume percentage change. Yeah. So, just like how you compare how much asset is up or down for the day, uh I do that for volume, meaning what was the volume and this doesn't look at the total volume for the day. So, this runs on, and Naman, this will be useful because uh there is alpha in here, which is uh So, David, you know, my database does not only just have candles, it also has ticks. So, I have I have about 53 billion rows in the database. Right. Yeah. And from from those ticks, I generate a 30-second candle. So, by default, the exchange gives you one-minute candle. And they also don't give you the buy and the sell information on that. They only give you the base volume, which is in the asset. So, it does not tell you what is the actual USD volume. So, you cannot compare across assets what is the base volume. Oh, sorry, what is the USD volume. Right. Yep. But this with the ticks, and with me generating a 30-second candle, I I can then see what was the buy volume, what was the sell volume, and what was the USD total volume. So, the first column is USD buy volume, USD sell volume, USD volume yesterday. But it is And then USD volume, buy volume today, sell volume today, USD total volume today. But this is today is not for the full day because today is up until from 00 to right now. So, I cannot compare the total from all of day yesterday to today. I have to compare um first four hours of yesterday to the first four hours of today. So, this script runs every 30 seconds. Right. Yep. And then, so this volume that you see on Siren, $810,000. That was not for the entire day. That was until this time yesterday. From the start of yesterday to until this time yesterday. So, you're comparing um the first four hours from yesterday to the first four hours from today, or first six hours from yesterday to the first six hours from today. Okay. Yep. And then it is calculating the percentage change between that volume. So, if you see the volume spiked up. And this is sorted by volume percentage change in the descending order. So, today the rank is 91, meaning it is still not in the top 50, it is it has climbed up to top 100 in volume, uh today. Because there are 400 assets, 460 on Binance futures. Uh And then today Siren is in the top 100 by trading volume. Uh And if you see because of the volume percentage change, the price has already gone up 15% on it. So, is that a lead lag as volume ticks up like outside of its norms and then then the price will follow? Yes. Yes. That's interesting. Because I I when you mentioned it before, I my sort of a feeling was that there might be a lag, um yeah, it might actually lag the other way, right? Um but that's interesting. So that works like a leading indicator. So, if you see, uh 1, 2, 3, 4, 5, 6th line from the top. Which is 1, 2, 3, 4, 5, 6. DUSDT. Yeah. Uh The volume percentage change is 1419. Yes. Uh Meaning the volume yesterday was around 1 million, today is around 23 million. But the price is still negative. Yes. That means the volume has picked up, the price has not yet picked up. So you expect the price to catch up? Yes. Uh, not not all the time, but there is a signal. So now if we see today what is going on with DUSDT, you will know uh that if it is still in the top 10, uh or what is uh here, we can look at the daily chart. On DUSDT. Uh Yeah, you see yesterday there was a huge volume spike on DUSDT. Yes, I see. So even though the price is down today, uh like it was up yesterday. It it closed down. But, uh it was up 20% yesterday from low to the high. 25%. So intraday there was Yeah, I'm looking at the five-minute chart on that now. See the volume coming in. And it peaks at the at the at the top. Yes. Which which you would expect. But as long as your signal is generated ahead of that. Yep. Then that's cool. And then I guess well, I'm I'm assuming it's like a a bit of a scalp trade. Yeah, so I don't Anything ranked greater than 20, I don't I was telling this to somebody yesterday for Bananas. Uh I only put say $1,000 in and that $1,000 I'm willing to donate to the market because of the tail risk. Like it could go down 90% and I will never see any of it. And I should be okay in doing that. Because that could go that could go 20 so here, when I took this screenshot, banana was up 51%. So that is like an outsized return, say $500 return on a $1,000 trade. Uh I'm definitely not capturing the lows and the highs, but I want to be able to capture the meat of the move. Like if it moves 20%, I want to capture 15 out of it. If it capture, if it moves 50%, I want to capture say 30 or 40% out of it. Yeah, okay. I imagine this kind of a strategy you'd have to backtest a lot of the permutations of it, right? Because that that volume signal has many points where it could be generated, right? Like if you're if you're That's You can't backtest on a single asset because it randomly market makers randomly choose or I don't know what their logic is. So you have to run it across all 460 to see which one has the volume change. Because otherwise you're picking with your hindsight bias and that doesn't essentially work. Yeah, but that's what I mean, right? Like like you have to backtest using your entire database. So you're you're testing the whole market universe every day. At the at the time, yes. Yeah. And have you been able to do that? Yes. Okay, that's cool. Uh yeah. Because you could because you could get in Just because the question is like when when do you start buying in? Like if if the volume is here, uh or 200% up, right? So the rank is only valuable if you can rank across multi and so I could not I could not do this on a one-minute candle because the exchange does not give me the volume in USD. The exchange gives me the volume in the base asset. Yep. To do this to compare all the assets and their volume daily, I need to convert that to USD a standard. And then, once I have converted that into USD, then I can rank them across volume, like what is the volume for the asset for the day, and how do 460 rank? And then there is also some uh edge in the delta. So, if you see, uh actually all of them, the delta, the CVD is negative. The price is up multiple digits like 15%, 20%, 6%, 50%, but the CVD buy minus sell is negative on all of them. Yeah, limit bids. Yes. No, not limit bids. It's just people taking profits and the price is still up. Yeah. Well, it has to be, right? If the price is up with the CVD's negative, it has to be you have to be the bid walking up the price. Yeah. So, so the signal is is in Do you just like look at the top 20 and and just pick the ones to trade, or or are you looking for the ones that have the biggest volume percent change? Um, so let me share the entire screenshot. Oh. Or or you could also you could also base it on I don't know if there's signal here like um you could look at which assets are climbing up the rankings the fastest? Yes, exactly. Yes, exactly. Now you're getting now you're getting the hang of it. Yeah. That is that is the edge. When an asset climbs up in ranking, uh some some asset It doesn't matter if it climbs up in ranking from uh 25 to 22, but it matters a lot if it is moving from say 220 to less than 100. Yeah. Yeah, that's the one. Yeah. But how can you get that unless you have the entire view of the market in real time? Great question. Yeah, I don't think you can. If you're looking at one asset at the Okay, look at this. Omni USDT today. It is up 84%. Yeah. Um the volume percentage change on that is uh 2,000. So, like four digit volume percentage change. It is in the top top 10. Like Omni USDT is in top 10. Crazy to me. So, I think you'd have to See, this is interesting. I I've got an observation on Omni, which is that I I'm going to share. Here, look at this. Now, sorry David, to interrupt. Um Because you asked because now you understand what the logic is behind the screener, I can share the entire screenshot. Initially, I only shared bits and pieces because one there was no interest and people didn't actually understand what they were looking at. But now you're looking at it and you understand that going up in ranking means the volume is increasing. Yeah, I think I So now, Yeah. The first table you see is by volume descending. Simple, rank 1 to 20. Yeah. I see. The second, this is just the same data frame printed in three different tables. There's one more table after that, but it is not very important. Uh The second one is volume percentage change, which is sorted by volume percentage change as it says. And then the third table is sorted by price percentage change. So the highest price is the top one. Okay. And this runs, this runs every 30 seconds. So when I get a new 30-second candle generated in my database, based on the ticks. So, look at this. On the top right corner. Uh This screenshot is from 16, 4 4:19 p.m. and 03 seconds. But it has data until 4:16, 4:19, 00. Like, if you see in the screenshot, it says, \"Time now today.\" Yeah. It has data up till that period. So, every It runs every 15 seconds, this script, and shows me the exact uh outlook of what is happening in the market. Like I don't need to look at the chart. I can just look at this and tell you what is moving. BTC ETH has 2X the volume of BTC. Like ETH volume today is $8 billion versus BTC is $9 billion. How it was yesterday. Yesterday at this time, ETH volume was $18 billion, 18.5. So, it is a little lower today. So, this I think, I think you, we might be generating some similar signals because for something like Omni, where it's doing absolutely nothing, then out of nowhere, it just explodes. Um, the funding rate signal, um, well, the funding rate signal fired at basically the same time. So, it fired on that at the top of that first big five-minute candle, the first expansive five-minute candle. Uh, I don't know where it would have triggered on a lower time frame, because we're not we're not using a lower time frame, but it might have triggered even sooner. I don't know. Um, but then, if we just work with the five-minute, for example. And then, if you and if you go long on the top of that on the close of that candle, then you get a momentum you get a momentum follow-through of another 15% right there. And that's Okay. It's a bit of an it's yeah, it's a bit of an outlier, I can't really compare because of how fast it is. But if if your system would have bought that, uh we we would have bought that too. I think we did buy that. Yeah, you see a massive drawdown. No? On the funding rate. Yeah. No, in general, like So, uh and I'll because uh how do I do this? Because this is an anomaly. Uh Not all the volume spikes happen like this. Because this one is unusual. Uh Yeah, it's a very fast one. Yeah, that is a bit of a weird one. And so I'm looking at a 30-second chart and the reason I'm looking at a 30-second chart is I I'm not trading HFT and so I'm waiting until a new 30-second candle shows up in my database. And so if you enter after the first 30-second candle, you you may still be barely able to just break even. Because there was no signal before the 30-second candle. Does that make sense? It makes sense. Uh I guess it depends how fast you're trading this. I mean, that first 30-second candle, it looks like it's closing around about $5. Yes. So, if you're getting in anywhere close to five, and you can trade it up to seven, but that's hindsight, David. We don't know if it'll pull back or if you So, so that's that's my question. Like is is it possible to backtest the the behavior of these of these things? Yeah, how do you how do you like how do you enter and exit these once you get a signal? Uh I enter, right now my entry is manual. So, I enter with a with a manual entry and a and a tight stop loss. Even yesterday, I took a trade on Bananas, um and rode up like 6, 7%, but that was me manually trailing the stop loss. It's not systematic. I have not been I have not converted this into a system. There is an edge, but I have not had the time to convert it into a systematic edge where I'll leave it and let it go on its own. So, so you're in a very similar place to us on the funding rate strategy. Uh is what it seems like to me. Um because our So, like so for us, for example, um the idea is once once we get the signal, we we want to we want to be long that market once our signal fires. Um then in terms of getting out, um so it will close an open position once the signal, um is no longer valid. If we still have the open position. But Okay. If if we let it run unattended, which is is what we've actually done for the last two, three days. Um it's really not not working as as good as when it's traded manually. Um So, it sounds like we're in a similar position actually to you then. So the one strategy to combat that, and this is what I learned from this is what I learned from Scott Philips is as you have new data coming in, you adjust your position every minute. You can't just So, when you generate the signal, it can't just be a binary long or short. It has to be adaptive to the new information coming in. So, say it went up in the next 30-second candle, it went up 30% or 5%. You you change your stop loss and you move your stop loss. So, it's the system should automatically have a trailing stop loss. Yeah, indeed. Indeed. And and there should be no take. There should be no take profit. Your exit out of the trade should be based on the stop loss. So, then your stop loss is in profit. Yes, in profit. In profit 2%, in profit 4%, in profit 6%. That has to be adaptive to the new market information that is coming in. So, especially when you that So that's that's my question to you, Q. So, so for your strategy, uh correct me if I'm wrong, but but I, you know, I think you're obviously you're buying these and it's and it's uh momentum it's a momentum long with some kind of a trailing stop. Yeah. Yeah, yeah, I mean that's basically how we would manually trade ours as well. Yes. Um the only sort of comment ours does have a profitable backtest with with no management. Uh but it's no but it's not as profitable. Sorry, who? Uh the funding rate the funding rate trade. I'm I'm sorry. I'm not following. Can you say that again, please? So, I'm I was just I was just doing a comparison of of of your of your your trade um with the the trade that we do using the funding rate. Um It's a different it's a different signal, but but it's a very similar trade, I think. Um It it has a lot of momentum early on. Um So, do you know if the exchanges change the funding rate only at the eight-hour mark or do they change it in the middle? Oh, no, they'll change it frequently. So, it updates in real time. Um and then the intervals, the default is every eight hours. But, um once funding rates start getting uh extreme, they'll change those intervals um just without warning. Oh, wow. Okay. So, this is something that um Naman had to do quite a lot of work on uh because it was it was mess really messing with our system at first because you know, the they would they would publish a funding rate, but the they weren't publishing what the what the interval was. So, if they say the funding rate is two, and that's based on eight hours, and then if it if it remains at two, but they change it to four hours, then it's actually four, right? Because it's uh it's 2% every four hours instead of every eight hours. Um but unless we know that they've updated it, we we couldn't adjust for it. Um and Naman did find a solution to to that in the end, but um that was one of the complicating factors. And so, so, So, the other thing I'm experiencing right now, if we want to backtest any strategy, we should only backtest on Bitcoin and see if it is profitable. Reason being that if you even do it on ETH or SOL, you're bringing your hindsight bias in. Meaning you know that SOL and ETH um have better reflexivity than BTC. Or the second option, if you really want to backtest a strategy, is to backtest across all the assets at the same time and have your strategy pick the assets based on the market information, the rank, whatever your logic is. Um and only then it will be able to pick the right asset across all the assets. Otherwise you're you're always introducing your hindsight bias in into the strategy. Yeah, that makes sense. That makes sense. And so the second option is much complicated, much harder to do um as a single developer. Um that means you're competing against the hedge fund teams who are doing this for a living and who have much more expertise than you do. And they have much more uh data much more complex systems uh than you do. And so, I would personally only backtest on BTC. Um see how the results are. Add fees in to make sure that you're not getting you're not thinking that your strategy is profitable, but when you actually bring it live, it is not. Yeah, 100%. Yeah. So, so, that is something that I want to, Um, if anything and if you have time and interest, I can share the code. Uh this is not in a UI. This is still outputting on the command line. So, what we can do is we can we can generate a dashboard that updates automatically and you and I can look at it. Because there's already all this data in the underlying database. We just need to and the queries are ready. Everything is ready. We just need to create the UI for it. If that is something that you are interested in. And so if you click on one of those symbols, it opens up the chart for you. Mammy. Okay. Yeah, I think I'd be very interested. And if it's possible Yeah, if it's possible whenever a symbol crosses a threshold or uh increasing rank or uh volume change. Yeah. Um just to observe it at least. And then it would be interesting to just to watch it for a week or two. Well, rather than uh gather all the data, we can just pair notes and maybe formulate some ideas. Yeah. Yeah. I think that could be that could be valuable. Yeah. I'm I'm very interested to see if or how often um the signals overlap with the funding rate signal as well. Yeah. Yes. And then it might maybe Yeah. So, So, the other thing is uh I would say um if Naman wants to work on is he can import the funding rates into my database. So, that way he's actively using the database. He's writing queries for it. Um and he can write a script. I can put it on my server. Uh which automatically collects the funding rate. Uh which he already has on his system. And so that way we can bring in the funding rate on this dashboard. Okay. Yeah, that would be interesting. Yeah. So, again, there's a lot of a lot of scope for where we can collaborate. Uh for now we can start with a simple backtesting strategy and then and then we can talk more. Okay. Yeah, Q, I think I'm happy with all of that. And then um So, lots of, okay, so lots of lots of things to do. Um we'll we'll fall back on the the tasks, the the immediate tasks that we discussed earlier. Yeah. Um and then yeah, let's re should we reconvene in uh in two or three days? Yeah, that's fine. Maybe one more time before Friday should be good. Okay, fantastic. Um And and if you don't mind, uh you don't have to do it now, but Naman, if you can share some code of what your strategy is and how it is. Otherwise there's I'll just be creating another a completely different strategy from what you have and then obviously the results won't match. So, I want to see if I can recreate your strategy in my back tester. Yeah, I think we can do that. Yeah. Okay, awesome. Um Okay. I I appreciate this call. Thank you. Yeah, likewise, likewise. Let's see what we can do with this. Um and uh yeah, we'll um stay active on the chat. Um Yeah. And uh we better go now cuz it's uh well it's it's past midnight here and I I don't want to know what time it is uh when I'm sorry it it it took a little longer than expected. No, all good. All good, all good Q. Good good chat. We used to it. Okay, thank you. Bye-bye. Awesome. Thanks Q. Speak soon. Yeah. Bye. Bye guys. My goodness, fucking done with that now, finally. Yes, he that must be there.",
        "error": null,
        "filename": "c5f3be16-649f-4343-b74c-774ee5a5e42e_2025-07-29_20-29-18.mp4",
        "created_at": "2025-08-08T12:52:29.450164",
        "completed_at": "2025-08-08T12:56:15.414636"
    }
}